{
    "note-2023.09.18-title": "Financial independence",
    "note-2023.09.18-text-01": "Some artists are more interested in success than art. The art world is ruled by connections and money, and these are people who want to make a career and ingratiate themselves with art critics, galleries and museums.",
    "note-2023.09.18-text-02": "Because I have become financially independent through my day job, software development, I have the luxury of being able to work free from monetary constraints.",
    "note-2023.09.18-text-03": "I prefer to have my own livelihood and income and the freedom to be creative without having to bow to commercial interests.",
    "note-2023.09.18-text-04": "A digital artist doesn't have to rent an extremely expensive art studio in New York. There are very few costs involved. All I need is a laptop, an internet connection and a website, etc. And as long as my basic needs are met, I can focus on creative work.",
    "note-2023.09.17-title": "Technology determines style",
    "note-2023.09.17-text-01": "The following lines are inspired by an interview given by Jean-Michel Jarre.",
    "note-2023.09.17-text-02": "When classical instruments like the piano or violin appeared, they changed the nature of music. The same thing happened and continues to happen today with electronic and purely digital instruments. And the same thing can be seen in different art forms.",
    "note-2023.09.17-text-03": "Technology determines style.",
    "note-2023.09.17-text-04": "In a 2017 interview, Jean-Michel Jarre said that without Native Instruments' \"Massive\" plugin, the dubstep genre probably wouldn't exist. I've also heard elsewhere that some plugins have had a big impact on electronic music genres.",
    "note-2023.09.17-text-05": "In generative design you can also see this with WebGL, Processing, p5.js and other tools. But we shouldn't be dependent on the software we use for generative design.",
    "note-2023.09.17-text-06": "We rely on these technologies, but you shouldn't expect too much from them. What differentiates the artists who use these technologies is the way they use them.",
    "note-2023.09.17-text-07": "I see my parameterized work in a similar way. Certain groups of parameters are like virtual instruments that give the work a certain \"sound quality\".",
    "note-2023.09.17-text-08": "This is an example of how one art form—electronic music—can influence another art form—creative design.",
    "note-2023.09.16-title": "Self-imposed restrictions",
    "note-2023.09.16-text-01": "I have imposed the following restrictions on myself:",
    "note-2023.09.16-text-02": "The shapes should be minimal—lines, rectangles, triangles.",
    "note-2023.09.16-text-03": "Two-dimensional flat drawings if possible.",
    "note-2023.09.16-text-04": "Not figurative, just abstract.",
    "note-2023.09.16-text-05": "Short algorithms are better because they are more likely to show the complex geometric patterns that arise from simple mathematical and algorithmic relationships.",
    "note-2023.09.16-text-06": "Not iterative. If possible, avoid \"first draw this part, then draw that part.\" The whole picture should emerge from a single idea, a single algorithm. (This is not always possible.)",
    "note-2023.09.16-text-07": "No text or emoji. Individual letters, kanji or other Unicode characters that are abstracted are possible.",
    "note-2023.09.16-text-08": "No external resources like images or fonts. The source code must be completely standalone and independent.",
    "note-2023.09.16-text-09": "No data visualization such as charts; no infographics.",
    "note-2023.09.16-text-10": "No interactivity with the mouse, trackpad or camera.",
    "note-2023.09.16-text-11": "No animations."
}
